Pandas & Data Analytics (VERY HIGH PROBABILITY)
DataFrame Basics

Create a DataFrame from a dictionary.

In [1]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "salary": [50000, 60000, 70000]
}
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'salary': [50000, 60000, 70000]}

In [4]:
import pandas as pd

df = pd.DataFrame(data)
df

      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

Select rows based on condition.

In [5]:
df[df["age"] > 30]

      name  age  salary
2  Charlie   35   70000

In [6]:
df[(df["age"] > 25) & (df["salary"] > 55000)]

      name  age  salary
1      Bob   30   60000
2  Charlie   35   70000

Select specific columns.

In [7]:
df[["name", "salary"]]

      name  salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000


Rename columns.

In [8]:
df = df.rename(columns={"name": "employee_name", "salary": "income"})
df.columns

Index(['employee_name', 'age', 'income'], dtype='object')

Change data types.

In [9]:
df.dtypes

employee_name    object
age               int64
income            int64
dtype: object

In [11]:
df["income"] = df["income"].astype(float)
df.dtypes

employee_name     object
age                int64
income           float64
dtype: object